In [1]:
import pandas as pd
import numpy as np

In [3]:
import os
print(os.getcwd())

/home/wangzhitao/Code/tf1-deeplearning/data_analysys

In [10]:
df_train = pd.read_csv('../data/titanic/train.csv')

In [18]:
df_train['Survived'].value_counts()

0    433
1    279
Name: Survived, dtype: int64

In [19]:
df_train['Survived'].value_counts().plot.bar()

In [12]:
df_test = pd.read_csv('../data/titanic/test.csv')

In [13]:
df_test['Survived'].value_counts()

0    116
1     63
Name: Survived, dtype: int64

In [14]:
df_train_p = df_train[df_train['Survived']==1]

In [15]:
df_train_p.shape

(279, 12)

In [16]:
df_train_p_sample = df_train_p.sample(n=43)

In [17]:
df_train_p_sample.shape

(43, 12)

In [21]:
df_train_new = pd.concat([df_train[df_train['Survived']==0], df_train_p_sample], ignore_index=True)

In [22]:
df_train_new.shape

(476, 12)

In [23]:
from sklearn.utils import shuffle

In [24]:
df_train_new = shuffle(df_train_new)

In [25]:
df_train_new.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
150,336,0,3,"Denkoff, Mr. Mitto",male,NaN,0,0,349225,7.8958,NaN,S
82,615,0,3,"Brocklebank, Mr. William Alfred",male,35.0,0,0,364512,8.0500,NaN,S
229,575,0,3,"Rush, Mr. Alfred George John",male,16.0,0,0,A/4. 20589,8.0500,NaN,S
129,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
463,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
81,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
381,265,0,3,"Henry, Miss. Delia",female,NaN,0,0,382649,7.7500,NaN,Q
304,659,0,2,"Eitemiller, Mr. George Floyd",male,23.0,0,0,29751,13.0000,NaN,S
131,250,0,2,"Carter, Rev. Ernest Courtenay",male,54.0,1,0,244252,26.0000,NaN,S
60,176,0,3,"Klasen, Mr. Klas Albin",male,18.0,1,1,350404,7.8542,NaN,S

In [26]:
df_test_p = df_test[df_test['Survived']==1]
df_test_p_sample = df_test_p.sample(20)
df_test_new = pd.concat([df_test[df_test['Survived']==0], df_test_p_sample], ignore_index=True)

In [27]:
df_test_new = shuffle(df_test_new)

In [28]:
df_test_new.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
133,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
59,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
83,214,0,2,"Givard, Mr. Hans Kristensen",male,30.0,0,0,250646,13.0000,NaN,S
44,838,0,3,"Sirota, Mr. Maurice",male,NaN,0,0,392092,8.0500,NaN,S
57,647,0,3,"Cor, Mr. Liudevit",male,19.0,0,0,349231,7.8958,NaN,S

In [29]:
df_train_new.to_csv('../data/unbalanced/train.csv', index=None)
df_test_new.to_csv('../data/unbalanced/test.csv', index=None)